[
  {"id":"chang-anMobileRobotPath2008","abstract":"To deal with the path planning of mobile robot in unknown environment, an improved rapidly-exploring random tree (RRT) is presented by analyzing basic RRT algorithm. We applied improved RRT algorithm to local navigation of a mobile robot in unknown environment. Detecting local unknown environments by robot sensor system, the method orients a biased direction from RRT algorithm is used to drive the robot to avoid obstacles and move to the goal. The method is not only simple and flexible, but also reduces the nodes of tree and the amount of calculation for real-time computation. We conducted the simulation to verify the proposed method in real unknown environment.","accessed":{"date-parts":[["2025",2,18]]},"author":[{"family":"Chang-an","given":"Liu"},{"family":"Jin-gang","given":"Chang"},{"family":"Guo-dong","given":"Li"},{"family":"Chun-yang","given":"Liu"}],"citation-key":"chang-anMobileRobotPath2008","container-title":"2008 IEEE International Conference on Automation and Logistics","DOI":"10.1109/ICAL.2008.4636565","event-title":"2008 IEEE International Conference on Automation and Logistics","ISSN":"2161-816X","issued":{"date-parts":[["2008",9]]},"page":"2375-2379","source":"IEEE Xplore","title":"Mobile robot path planning based on an improved rapidly-exploring random tree in unknown environment","type":"paper-conference","URL":"https://ieeexplore.ieee.org/abstract/document/4636565"},
  {"id":"gasparettoPathPlanningTrajectory2015","accessed":{"date-parts":[["2024",10,2]]},"author":[{"family":"Gasparetto","given":"Alessandro"},{"family":"Boscariol","given":"Paolo"},{"family":"Lanzutti","given":"Albano"},{"family":"Vidoni","given":"Renato"}],"citation-key":"gasparettoPathPlanningTrajectory2015","container-title":"Motion and Operation Planning of Robotic Systems","DOI":"10.1007/978-3-319-14705-5_1","editor":[{"family":"Carbone","given":"Giuseppe"},{"family":"Gomez-Bravo","given":"Fernando"}],"event-place":"Cham","ISBN":"978-3-319-14704-8 978-3-319-14705-5","issued":{"date-parts":[["2015"]]},"language":"en","page":"3-27","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Path Planning and Trajectory Planning Algorithms: A General Overview","title-short":"Path Planning and Trajectory Planning Algorithms","type":"chapter","URL":"https://link.springer.com/10.1007/978-3-319-14705-5_1","volume":"29"},
  {"id":"hartFormalBasisHeuristic1968","accessed":{"date-parts":[["2024",11,5]]},"author":[{"family":"Hart","given":"Peter"},{"family":"Nilsson","given":"Nils"},{"family":"Raphael","given":"Bertram"}],"citation-key":"hartFormalBasisHeuristic1968","container-title":"IEEE Transactions on Systems Science and Cybernetics","container-title-short":"IEEE Trans. Syst. Sci. Cyber.","DOI":"10.1109/TSSC.1968.300136","ISSN":"0536-1567","issue":"2","issued":{"date-parts":[["1968"]]},"language":"en","license":"https://ieeexplore.ieee.org/Xplorehelp/downloads/license-information/IEEE.html","page":"100-107","source":"DOI.org (Crossref)","title":"A Formal Basis for the Heuristic Determination of Minimum Cost Paths","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/4082128/","volume":"4"},
  {"id":"huangNeuralInformedRRT2024","abstract":"Sampling-based planning algorithms like Rapidly-exploring Random Tree (RRT) are versatile in solving path planning problems. RRT* offers asymptotic optimality but requires growing the tree uniformly over the free space, which leaves room for efficiency improvement. To accelerate convergence, rule-based informed approaches sample states in an admissible ellipsoidal subset of the space determined by the current path cost. Learning-based alternatives model the topology of the free space and infer the states close to the optimal path to guide planning. We propose Neural Informed RRT* to combine the strengths from both sides. We define point cloud representations of free states. We perform Neural Focus, which constrains the point cloud within the admissible ellipsoidal subset from Informed RRT*, and feeds into PointNet++ for refined guidance state inference. In addition, we introduce Neural Connect to build connectivity of the guidance state set and further boost performance in challenging planning problems. Our method surpasses previous works in path planning benchmarks while preserving probabilistic completeness and asymptotic optimality. We deploy our method on a mobile robot and demonstrate real world navigation around static obstacles and dynamic humans. Code is available at https://github.com/tedhuang96/nirrt_star.","accessed":{"date-parts":[["2025",2,19]]},"author":[{"family":"Huang","given":"Zhe"},{"family":"Chen","given":"Hongyu"},{"family":"Pohovey","given":"John"},{"family":"Driggs-Campbell","given":"Katherine"}],"citation-key":"huangNeuralInformedRRT2024","DOI":"10.48550/arXiv.2309.14595","issued":{"date-parts":[["2024",3,7]]},"number":"arXiv:2309.14595","publisher":"arXiv","source":"arXiv.org","title":"Neural Informed RRT*: Learning-based Path Planning with Point Cloud State Representations under Admissible Ellipsoidal Constraints","title-short":"Neural Informed RRT*","type":"article","URL":"http://arxiv.org/abs/2309.14595"},
  {"id":"huELEGNTExpressiveFunctional2025","abstract":"Nonverbal behaviors such as posture, gestures, and gaze are essential for conveying internal states, both consciously and unconsciously, in human interaction. For robots to interact more naturally with humans, robot movement design should likewise integrate expressive qualities, such as intention, attention, and emotions, alongside traditional functional considerations like task fulfillment and time efficiency. In this paper, we present the design and prototyping of a lamp-like robot that explores the interplay between functional and expressive objectives in movement design. Using a research-through-design methodology, we document the hardware design process, define expressive movement primitives, and outline a set of interaction scenario storyboards. We propose a framework that incorporates both functional and expressive utilities during movement generation, and implement the robot behavior sequences in different function- and social- oriented tasks. Through a user study comparing expression-driven versus function-driven movements across six task scenarios, our findings indicate that expression-driven movements significantly enhance user engagement and perceived robot qualities. This effect is especially pronounced in social-oriented tasks.","accessed":{"date-parts":[["2025",2,13]]},"author":[{"family":"Hu","given":"Yuhan"},{"family":"Huang","given":"Peide"},{"family":"Sivapurapu","given":"Mouli"},{"family":"Zhang","given":"Jian"}],"citation-key":"huELEGNTExpressiveFunctional2025","DOI":"10.48550/arXiv.2501.12493","issued":{"date-parts":[["2025",1,21]]},"number":"arXiv:2501.12493","publisher":"arXiv","source":"arXiv.org","title":"ELEGNT: Expressive and Functional Movement Design for Non-anthropomorphic Robot","title-short":"ELEGNT","type":"article","URL":"http://arxiv.org/abs/2501.12493","version":"1"},
  {"id":"ichterLearningSamplingDistributions2018","abstract":"A defining feature of sampling-based motion planning is the reliance on an implicit representation of the state space, which is enabled by a set of probing samples. Traditionally, these samples are drawn either probabilistically or deterministically to uniformly cover the state space. Yet, the motion of many robotic systems is often restricted to “small” regions of the state space, due to e.g. differential constraints or collision-avoidance constraints. To accelerate the planning process, it is thus desirable to devise non-uniform sampling strategies that favor sampling in those regions where an optimal solution might lie. This paper proposes a methodology for nonuniform sampling, whereby a sampling distribution is learned from demonstrations, and then used to bias sampling. The sampling distribution is computed through a conditional variational autoencoder, allowing sample generation from the latent space conditioned on the specific planning problem. This methodology is general, can be used in combination with any sampling-based planner, and can effectively exploit the underlying structure of a planning problem while maintaining the theoretical guarantees of sampling-based approaches. Specifically, on several planning problems, the proposed methodology is shown to effectively learn representations for the relevant regions of the state space, resulting in an order of magnitude improvement in terms of success rate and convergence to the optimal cost.","accessed":{"date-parts":[["2025",2,19]]},"author":[{"family":"Ichter","given":"Brian"},{"family":"Harrison","given":"James"},{"family":"Pavone","given":"Marco"}],"citation-key":"ichterLearningSamplingDistributions2018","container-title":"2018 IEEE International Conference on Robotics and Automation (ICRA)","DOI":"10.1109/ICRA.2018.8460730","event-title":"2018 IEEE International Conference on Robotics and Automation (ICRA)","ISSN":"2577-087X","issued":{"date-parts":[["2018",5]]},"page":"7087-7094","source":"IEEE Xplore","title":"Learning Sampling Distributions for Robot Motion Planning","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/8460730/?arnumber=8460730"},
  {"id":"paliwalSurveyAStarAlgorithm2023","abstract":"For autonomous vehicles, one of the prime tasks to be able to function without any human assistance is the task of motion planning. Motion planning involves planning a safe, collision-free and a computationally feasible path to avoid the obstacles in their way and precisely reach the desired location in as less time as possible. The continual efforts in developing new and improving existing path planning algorithms has led to significant advances in improving the autonomy of the autonomous vehicles. One of the most popular algorithms used in path planning is the A* search algorithm, whose several variations have been formulated over the years. This gives a rise to the need of a comprehensive survey of such variations of the algorithm. This paper presents a review of various variations of the A* algorithm along with a brief review of the classical A* algorithm.","accessed":{"date-parts":[["2024",10,25]]},"author":[{"family":"Paliwal","given":"Pulkit"}],"citation-key":"paliwalSurveyAStarAlgorithm2023","container-title":"2023 IEEE International Students' Conference on Electrical, Electronics and Computer Science (SCEECS)","DOI":"10.1109/SCEECS57921.2023.10063063","event-place":"Bhopal, India","event-title":"2023 IEEE International Students' Conference on Electrical, Electronics and Computer Science (SCEECS)","ISBN":"979-8-3503-9874-8","issued":{"date-parts":[["2023",2,18]]},"language":"en","license":"https://doi.org/10.15223/policy-029","page":"1-6","publisher":"IEEE","publisher-place":"Bhopal, India","source":"DOI.org (Crossref)","title":"A Survey of A-Star Algorithm Family for Motion Planning of Autonomous Vehicles","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/10063063/"},
  {"id":"rickertBalancingExplorationExploitation2014","accessed":{"date-parts":[["2025",2,14]]},"author":[{"family":"Rickert","given":"Markus"},{"family":"Sieverling","given":"Arne"},{"family":"Brock","given":"Oliver"}],"citation-key":"rickertBalancingExplorationExploitation2014","container-title":"IEEE Transactions on Robotics","issue":"6","issued":{"date-parts":[["2014"]]},"page":"1305–1317","publisher":"IEEE","source":"Google Scholar","title":"Balancing exploration and exploitation in sampling-based motion planning","type":"article-journal","URL":"https://ieeexplore.ieee.org/abstract/document/6871370/","volume":"30"},
  {"id":"sariffOverviewAutonomousMobile2006","accessed":{"date-parts":[["2024",10,2]]},"author":[{"family":"Sariff","given":"N."},{"family":"Buniyamin","given":"Norlida"}],"citation-key":"sariffOverviewAutonomousMobile2006","container-title":"2006 4th student conference on research and development","issued":{"date-parts":[["2006"]]},"page":"183–188","publisher":"IEEE","source":"Google Scholar","title":"An overview of autonomous mobile robot path planning algorithms","type":"paper-conference","URL":"https://ieeexplore.ieee.org/abstract/document/4339335/"},
  {"id":"stentzOptimalEfficientPath1994","accessed":{"date-parts":[["2024",10,2]]},"author":[{"family":"Stentz","given":"Anthony"}],"citation-key":"stentzOptimalEfficientPath1994","container-title":"Proceedings of the 1994 IEEE international conference on robotics and automation","issued":{"date-parts":[["1994"]]},"page":"3310–3317","publisher":"IEEE","source":"Google Scholar","title":"Optimal and efficient path planning for partially-known environments","type":"paper-conference","URL":"https://ieeexplore.ieee.org/abstract/document/351061/"},
  {"id":"tianApplicationRRTbasedLocal2007","abstract":"Path planning for mobile robots has received a great deal of attention over the past two decades. The basic rapidly-exploring random tree (RRT) algorithm is famous in this field because it excels at exploring free space in the large environments and it is parallelizable. In this paper, we applied modified RRT algorithm to local navigation of a mobile robot in unknown environment. The biased direction from RRT algorithm is used to reduce the nodes and therefore the amount of calculation is decreased for real-time computation. We conducted the simulation and simple real-time experiments to verify the proposed method in real unknown environment.","accessed":{"date-parts":[["2025",2,18]]},"author":[{"family":"Tian","given":"Yu"},{"family":"Yan","given":"Lei"},{"family":"Park","given":"Gun-Young"},{"family":"Yang","given":"Seung-Han"},{"family":"Kim","given":"Young-Suk"},{"family":"Lee","given":"Sang-Ryong"},{"family":"Lee","given":"Choon-Young"}],"citation-key":"tianApplicationRRTbasedLocal2007","container-title":"2007 International Symposium on Computational Intelligence in Robotics and Automation","DOI":"10.1109/CIRA.2007.382896","event-title":"2007 International Symposium on Computational Intelligence in Robotics and Automation","issued":{"date-parts":[["2007",6]]},"page":"456-460","source":"IEEE Xplore","title":"Application of RRT-based local Path Planning Algorithm in Unknown Environment","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/4269896#citations"},
  {"id":"wangNeuralRRTLearningBased2020","abstract":"Rapidly random-exploring tree (RRT) and its variants are very popular due to their ability to quickly and efficiently explore the state space. However, they suffer sensitivity to the initial solution and slow convergence to the optimal solution, which means that they consume a lot of memory and time to find the optimal path. It is critical to quickly find a short path in many applications such as the autonomous vehicle with limited power/fuel. To overcome these limitations, we propose a novel optimal path planning algorithm based on the convolutional neural network (CNN), namely the neural RRT* (NRRT*). The NRRT* utilizes a nonuniform sampling distribution generated from a CNN model. The model is trained using quantities of successful path planning cases. In this article, we use the A* algorithm to generate the training data set consisting of the map information and the optimal path. For a given task, the proposed CNN model can predict the probability distribution of the optimal path on the map, which is used to guide the sampling process. The time cost and memory usage of the planned path are selected as the metric to demonstrate the effectiveness and efficiency of the NRRT*. The simulation results reveal that the NRRT* can achieve convincing performance compared with the state-of-the-art path planning algorithms. Note to Practitioners-The motivation of this article stems from the need to develop a fast and efficient path planning algorithm for practical applications such as autonomous driving, warehouse robot, and countless others. Sampling-based algorithms are widely used in these areas due to their good scalability and high efficiency. However, the quality of the initial path is not guaranteed and it takes much time to converge to the optimal path. To quickly obtain a high-quality initial path and accelerate the convergence speed, we propose the NRRT*. It utilizes a nonuniform sampling distribution and achieves better performance. The NRRT* can be also applied to other sampling-based algorithms for improved results in different applications.","accessed":{"date-parts":[["2025",2,13]]},"author":[{"family":"Wang","given":"Jiankun"},{"family":"Chi","given":"Wenzheng"},{"family":"Li","given":"Chenming"},{"family":"Wang","given":"Chaoqun"},{"family":"Meng","given":"Max Q.-H."}],"citation-key":"wangNeuralRRTLearningBased2020","container-title":"IEEE Transactions on Automation Science and Engineering","DOI":"10.1109/TASE.2020.2976560","ISSN":"1558-3783","issue":"4","issued":{"date-parts":[["2020",10]]},"page":"1748-1758","source":"IEEE Xplore","title":"Neural RRT*: Learning-Based Optimal Path Planning","title-short":"Neural RRT*","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/9037111","volume":"17"},
  {"id":"zhangMotionPlanningRobotics2025","abstract":"Recent advancements in robotics have transformed industries such as manufacturing, logistics, surgery, and planetary exploration. A key challenge is developing efficient motion planning algorithms that allow robots to navigate complex environments while avoiding collisions and optimizing metrics like path length, sweep area, execution time, and energy consumption. Among the available algorithms, sampling-based methods have gained the most traction in both research and industry due to their ability to handle complex environments, explore free space, and offer probabilistic completeness along with other formal guarantees. Despite their widespread application, significant challenges still remain. To advance future planning algorithms, it is essential to review the current state-of-the-art solutions and their limitations. In this context, this work aims to shed light on these challenges and assess the development and applicability of sampling-based methods. Furthermore, we aim to provide an in-depth analysis of the design and evaluation of ten of the most popular planners across various scenarios. Our findings highlight the strides made in sampling-based methods while underscoring persistent challenges. This work offers an overview of the important ongoing research in robotic motion planning.","accessed":{"date-parts":[["2025",2,18]]},"author":[{"family":"Zhang","given":"Liding"},{"family":"Cai","given":"Kuanqi"},{"family":"Sun","given":"Zewei"},{"family":"Bing","given":"Zhenshan"},{"family":"Wang","given":"Chaoqun"},{"family":"Figueredo","given":"Luis"},{"family":"Haddadin","given":"Sami"},{"family":"Knoll","given":"Alois"}],"citation-key":"zhangMotionPlanningRobotics2025","container-title":"Biomimetic Intelligence and Robotics","container-title-short":"Biomimetic Intelligence and Robotics","DOI":"10.1016/j.birob.2024.100207","ISSN":"2667-3797","issue":"1","issued":{"date-parts":[["2025",3,1]]},"page":"100207","source":"ScienceDirect","title":"Motion planning for robotics: A review for sampling-based planners","title-short":"Motion planning for robotics","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S2667379724000652","volume":"5"},
  {"id":"zhangPathPlanningMobile2018","accessed":{"date-parts":[["2024",10,2]]},"author":[{"family":"Zhang","given":"Han-ye"},{"family":"Lin","given":"Wei-ming"},{"family":"Chen","given":"Ai-xia"}],"citation-key":"zhangPathPlanningMobile2018","container-title":"Symmetry","issue":"10","issued":{"date-parts":[["2018"]]},"page":"450","publisher":"MDPI","source":"Google Scholar","title":"Path planning for the mobile robot: A review","title-short":"Path planning for the mobile robot","type":"article-journal","URL":"https://www.mdpi.com/2073-8994/10/10/450","volume":"10"},
  {"id":"zhaoAutonomousDrivingSystem2024","abstract":"Automation is increasingly at the forefront of transportation research, with the potential to bring fully auton­ omous vehicles to our roads in the coming years. This comprehensive survey provides a holistic look at the essential components and cutting-edge technologies that are driving the development and implementation of autonomous driving. It starts by evaluating two critical system architectures that are fundamental to the oper­ ation of autonomous vehicles: the layered and end-to-end structures. It then examines the critical areas of scene perception and localization, emphasizing the importance of sensor technologies. These technologies are vital for tasks such as object detection and semantic segmentation, which allow vehicles to understand and navigate their environment. A special focus is given to the complex topic of object detection, along with suggestions for how it can be enhanced. The survey then proceeds to provide detailed discussions on path planning, trajectory pre­ diction, and decision-making processes. These elements are crucial for the smooth navigation of autonomous vehicles, and the survey highlights the role of artificial intelligence (AI) and machine learning in these processes. Overall, the survey presents the rapid progress in the field of autonomous driving, offering a comprehensive assessment of the technologies and innovations that are essential for moving toward a safe and efficient autonomous future.","accessed":{"date-parts":[["2024",10,8]]},"author":[{"family":"Zhao","given":"Jingyuan"},{"family":"Zhao","given":"Wenyi"},{"family":"Deng","given":"Bo"},{"family":"Wang","given":"Zhenghong"},{"family":"Zhang","given":"Feng"},{"family":"Zheng","given":"Wenxiang"},{"family":"Cao","given":"Wanke"},{"family":"Nan","given":"Jinrui"},{"family":"Lian","given":"Yubo"},{"family":"Burke","given":"Andrew F."}],"citation-key":"zhaoAutonomousDrivingSystem2024","container-title":"Expert Systems with Applications","container-title-short":"Expert Systems with Applications","DOI":"10.1016/j.eswa.2023.122836","ISSN":"09574174","issued":{"date-parts":[["2024",5]]},"language":"en","page":"122836","source":"DOI.org (Crossref)","title":"Autonomous driving system: A comprehensive survey","title-short":"Autonomous driving system","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0957417423033389","volume":"242"},
  {"id":"zotero-1","citation-key":"zotero-1","type":"thesis"}
]
